app/controllers/products_controller.rb

INSERT INTO "products" ("title", "price", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Banana"], ["price", 100], ["description", "123"], ["created_at", 2017-06-05 10:49:46 UTC], ["updated_at", 2017-06-05 10:49:46 UTC]]
---
    def create
    @new_product = Product.new(product_params)
    if @new_product.save